app/controllers/school_classes_controller.rb

  def index
    @school_class = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

  def create
    if params[:school_class][:title] !="" && params[:school_class][:room_number] !="" then
    @school_class = SchoolClass.create(params.require(:school_class))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-01-02 16:57:25.559275"], ["updated_at", "2017-01-02 16:57:25.559275"]]