app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-12-15 09:37:23.469590"], ["updated_at", "2016-12-15 09:37:23.469590"]]
---
  def create
    if params[:student][:first_name] !='' && params[:student][:first_name]!=''
      @student=Student.create(params.require(:student))